wosayttn/M55M1BSP/SampleCode/StdDriver/OTG_Dual_Role_UMAS/main.c
    /* Select USBH module clock source */
    CLK_SetModuleClock(USBH0_MODULE, CLK_USBSEL_USBSEL_HIRC48M, CLK_USBDIV_USBDIV(1));
    /* Enable USBH module clock */
    CLK_EnableModuleClock(USBH0_MODULE);

    /* Select USBD module clock source */
    CLK_SetModuleClock(USBD0_MODULE, CLK_USBSEL_USBSEL_HIRC48M, CLK_USBDIV_USBDIV(1));
    /* Enable USBD module clock */
    CLK_EnableModuleClock(USBD0_MODULE);

    /* Enable OTG module clock */
    CLK_EnableModuleClock(OTG0_MODULE);

    /* Enable UART0 module clock */
    SetDebugUartCLK();

    /* Set OTG as USB Host role */
    SYS->USBPHY = (0x1ul << (SYS_USBPHY_HSOTGPHYEN_Pos)) | (0x3ul << (SYS_USBPHY_HSUSBROLE_Pos)) | (0x1ul << (SYS_USBPHY_OTGPHYEN_Pos)) | (0x3 << SYS_USBPHY_USBROLE_Pos);
    delay_us(20);
    //SYS->USBPHY |= (0x1ul << (SYS_USBPHY_HSUSBACT_Pos));//Set HSUSB PHY Active.

    /* Update System Core Clock */
    /* User can use SystemCoreClockUpdate() to calculate SystemCoreClock. */
    SystemCoreClockUpdate();

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set multi-function pins for UART0 RXD and TXD */
    SetDebugUartMFP();

    /* USB_VBUS_EN (USB 1.1 VBUS power enable pin) multi-function pin - PB.15     */
    SET_USB_VBUS_EN_PB15();

    /* USB_VBUS_ST (USB 1.1 over-current detect pin) multi-function pin - PC.14   */
    SET_USB_VBUS_ST_PC14();

    /* HSUSB_VBUS_EN (USB 2.0 VBUS power enable pin) multi-function pin - PB.10   */
    //SET_HSUSB_VBUS_EN_PB10();
    SET_HSUSB_VBUS_EN_PJ13();

    /* HSUSB_VBUS_ST (USB 2.0 over-current detect pin) multi-function pin - PB.11 */
    //SET_HSUSB_VBUS_ST_PB11();
    SET_HSUSB_VBUS_ST_PJ12();

    /* USB 1.1 port multi-function pin VBUS, D+, D-, and ID pins */
    SET_USB_VBUS_PA12();
    SET_USB_D_MINUS_PA13();
    SET_USB_D_PLUS_PA14();
    SET_USB_OTG_ID_PA15();

    SystemCoreClockUpdate();
    /* Lock protected registers */
    SYS_LockReg();

}

void USBH_Process(void)
{
    char *ptr, *ptr2;
    unsigned long p1, p2, p3;
    BYTE *buf;
    FATFS *fs;              /* Pointer to file system object */
    FRESULT res;
    TCHAR usb_path[] = { '3', ':', 0 };    /* USB drive started from 3 */

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;
    uint32_t t0;

    usbh_pooling_hubs();
    f_chdrive(usb_path);          /* set default path */

    for (;;)
    {
        if (!s_u8IsAdevice)
        {
            printf("break-A (OTG_STATUS: 0x%x)\n", OTG->STATUS);
            return;
        }

        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = s_achLine;

        get_line(ptr, sizeof(s_achLine));

        switch (*ptr++)
        {
            case '4' :
            case '5' :
            case '6' :
            case '7' :
                ptr--;
                *(ptr + 1) = ':';
                *(ptr + 2) = 0;
                put_rc(f_chdrive((TCHAR *)ptr));
                break;

            case 'd' :     /* d [<lba>] - Dump sector */
                if (!xatoi(&ptr, (long *)&p2)) p2 = sect;

                res = (FRESULT)disk_read(3, s_pu8Buff1, p2, 1);

                if (res)
                {
                    printf("rc=%d\n", (WORD)res);
                    break;
                }

                sect = p2 + 1;
                printf("Sector:%d\n", (INT)p2);

                for (buf = (unsigned char *)s_pu8Buff1, ofs = 0; ofs < 0x200; buf += 16, ofs += 16)
                    put_dump(buf, ofs, 16);

                break;

            case 'b' :
                switch (*ptr++)
                {
                    case 'd' :  /* bd <addr> - Dump R/W buffer */
                        if (!xatoi(&ptr, (long *)&p1)) break;

                        for (ptr = (char *)&s_pu8Buff1[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr += 16, ofs += 16)
                            put_dump((BYTE *)ptr, ofs, 16);

                        break;

                    case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                        if (!xatoi(&ptr, (long *)&p1)) break;

                        if (xatoi(&ptr, (long *)&p2))
                        {
                            do
                            {
                                s_pu8Buff1[p1++] = (BYTE)p2;
                            } while (xatoi(&ptr, (long *)&p2));

                            break;
                        }

                        for (;;)
                        {
                            printf("%04X %02X-", (WORD)p1, s_pu8Buff1[p1]);
                            get_line(s_achLine, sizeof(s_achLine));
                            ptr = s_achLine;

                            if (*ptr == '.') break;

                            if (*ptr < ' ')
                            {
                                p1++;
                                continue;
                            }

                            if (xatoi(&ptr, (long *)&p2))
                                s_pu8Buff1[p1++] = (BYTE)p2;
                            else
                                printf("???\n");
                        }

                        break;

                    case 'r' :  /* br <sector> [<n>] - Read disk into R/W buffer */
                        if (!xatoi(&ptr, (long *)&p2)) break;

                        if (!xatoi(&ptr, (long *)&p3)) p3 = 1;

                        printf("rc=%d\n", disk_read(0, s_pu8Buff1, p2, p3));
                        break;

                    case 'w' :  /* bw <sector> [<n>] - Write R/W buffer into disk */
                        if (!xatoi(&ptr, (long *)&p2)) break;

                        if (!xatoi(&ptr, (long *)&p3)) p3 = 1;

                        printf("rc=%d\n", disk_write(0, s_pu8Buff1, p2, p3));
                        break;

                    case 'f' :  /* bf <n> - Fill working buffer */
                        if (!xatoi(&ptr, (long *)&p1)) break;

                        memset(s_pu8Buff1, (int)p1, BUFF_SIZE);
                        break;

