wosayttn/M55M1BSP/SampleCode/StdDriver/OTG_Dual_Role_UMAS/main.c
    /* Init UART for printf */
    UART_Init();

    /* Lock protected registers */
    SYS_LockReg();

    enable_sys_tick(100);
    printf("\n\n");
    printf("system clock :%uMHz\r\n", SystemCoreClock);
    printf("+------------------------------------------------------+\n");
    printf("|                                                      |\n");
    printf("|     OTG ID dependent Mass Storage sample program     |\n");
    printf("|                                                      |\n");
    printf("+------------------------------------------------------+\n");

    printf("The USB role is determined by the ID pin state of USB cable.\n");
    printf("If acts as a USB host, it can access a mass storage device with a simple file system. ");
    printf("Type '?' on command line to show all supported commands.\n");
    printf("If attempts to switch the USB role as a USB device, press 'Enter' key after unplugging the USB cable to exit the file system. ");
    printf("Then plug a proper USB connector to switch the USB role as a mass storage device. The internal data flash is used as the storage.\n");

    OTG_ENABLE_PHY();
    /* Enable ID detection function */
    OTG_ENABLE_ID_DETECT();
    NVIC_EnableIRQ(USBOTG_IRQn);
    delay_us(1000);

    s_pu8Buff1 = (BYTE *)((uint32_t)&s_au8BuffPool1[0]);
    s_pu8Buff2 = (BYTE *)((uint32_t)&s_au8BuffPool2[0]);

    usbh_core_init();
    usbh_umas_init();
    USBH_Process();

    while (1)
    {
        if (OTG_GET_STATUS(OTG_STATUS_IDSTS_Msk))  /* B-device */
        {
            if (OTG_GET_STATUS(OTG_STATUS_VBUSVLD_Msk))  /* plug-in */
            {
                USBD_Open(&gsInfo, MSC_ClassRequest, NULL);
                USBD_SetConfigCallback(MSC_SetConfig);
                MSC_Init();
                NVIC_EnableIRQ(USBD_IRQn);
                printf("B-device (OTG_STATUS: 0x%x)\n", OTG->STATUS);

                /* Start transaction */
                while (1)
                {
                    if (USBD_IS_ATTACHED())
                    {
                        USBD_Start();
                        break;
                    }

                    if (OTG_GET_STATUS(OTG_STATUS_BVLD_Msk) == 0)
                        break;
                }

                /* Clear B-device session valid state change interrupt flag */
                OTG_CLR_INT_FLAG(OTG_INTSTS_BVLDCHGIF_Msk);
                /* Enable B-device session valid state change interrupt */
                OTG_ENABLE_INT(OTG_INTEN_BVLDCHGIEN_Msk);

                while (1)
                {
                    if (OTG_GET_STATUS(OTG_STATUS_BVLD_Msk) == 0)
                        break;

                    MSC_ProcessCmd();
                }

                /* Disable B-device session valid state change interrupt */
                OTG->INTEN &= ~OTG_INTEN_BVLDCHGIEN_Msk;
                /* Clear B-device session valid state change interrupt flag */
                OTG_CLR_INT_FLAG(OTG_INTSTS_BVLDCHGIF_Msk);
                printf("break-B (OTG_STATUS: 0x%x)\n", OTG->STATUS);
            }
        }
        else     /* A-device */
        {
            s_u8IsAdevice = 1;
            printf("A-device (OTG_STATUS: 0x%x)\n", OTG->STATUS);
            /* Clear ID status changed interrupt flag */
            OTG_CLR_INT_FLAG(OTG_INTSTS_IDCHGIF_Msk);
            /* Enable ID status changed interrupt */
            OTG_ENABLE_INT(OTG_INTEN_IDCHGIEN_Msk);
            USBH_Process();
            /* Disable ID status changed interrupt */
            OTG_DISABLE_INT(OTG_INTEN_IDCHGIEN_Msk);
        }
    }
}
